In [2]:
import pandas as pd
import numpy as np

In [3]:
Students_Performance = pd.read_csv('StudentsPerformance.csv')

In [7]:
Students_Performance.tail()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [8]:
Students_Performance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [10]:
Students_Performance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [11]:
Students_Performance.shape

(1000, 8)

In [13]:
Students_Performance.groupby('gender').aggregate({'writing score' : 'mean'})

        writing score
gender
female      72.467181
male        63.311203

In [14]:
Students_Performance.size

8000

In [15]:
Students_Performance.iloc[0:3, 0:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course
0,female,group B,bachelor's degree,standard,none
1,female,group C,some college,standard,completed
2,female,group B,master's degree,standard,none

In [19]:
Students_Performance.iloc[0:3, [-1, -2, 1, 0]]

   writing score  reading score race/ethnicity  gender
0             74             72        group B  female
1             88             90        group C  female
2             93             95        group B  female

In [22]:
students_performance_dataframe = Students_Performance.iloc[[0,3,4,7,8]]

In [23]:
students_performance_dataframe

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
7,male,group B,some college,free/reduced,none,40,43,39
8,male,group D,high school,free/reduced,completed,64,64,67

In [24]:
students_performance_dataframe.index = ['Maria','Mark','Ivan','Pol','Mario']

In [25]:
students_performance_dataframe

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
Maria,female,group B,bachelor's degree,standard,none,72,72,74
Mark,male,group A,associate's degree,free/reduced,none,47,57,44
Ivan,male,group C,some college,standard,none,76,78,75
Pol,male,group B,some college,free/reduced,none,40,43,39
Mario,male,group D,high school,free/reduced,completed,64,64,67

In [27]:
students_performance_dataframe.loc[['Maria', 'Mark', 'Pol'], ['gender','math score']]

       gender  math score
Maria  female          72
Mark     male          47
Pol      male          40

In [30]:
type(students_performance_dataframe.loc[['Maria', 'Mark', 'Pol'], ['gender','math score']])

pandas.core.frame.DataFrame

In [28]:
students_performance_dataframe.iloc[:,0]

Maria    female
Mark       male
Ivan       male
Pol        male
Mario      male
Name: gender, dtype: object

In [29]:
type(students_performance_dataframe.iloc[:,0])

pandas.core.series.Series

In [31]:
pd.Series(['x','y','z'])

0    x
1    y
2    z
dtype: object

In [32]:
pd.Series(['1','2','3'], index = ['Maria', 'Mark', 'Pol'])

Maria    1
Mark     2
Pol      3
dtype: object

In [35]:
my_series_1 = pd.Series(['1','2','3'], index = ['Maria', 'Mark', 'Pol'])
my_series_2 = pd.Series(['4','5','6'], index = ['Maria', 'Mark', 'Pol'])

In [36]:
pd.DataFrame({'Порядковый номер':my_series_1, 'Высота в белоголовых орланах':my_series_2})

      Порядковый номер Высота в белоголовых орланах
Maria                1                            4
Mark                 2                            5
Pol                  3                            6

In [38]:
students_performance_dataframe['gender'] # на выходе будет серия

Maria    female
Mark       male
Ivan       male
Pol        male
Mario      male
Name: gender, dtype: object

In [39]:
students_performance_dataframe[['gender']] # возьми от всего dataframe только первую колонку

       gender
Maria  female
Mark     male
Ivan     male
Pol      male
Mario    male

In [40]:
students_performance_dataframe['gender'].shape

(5,)

In [41]:
students_performance_dataframe[['gender']].shape

(5, 1)

In [42]:
Students_Performance.iloc[0:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [43]:
Students_Performance.iloc[:7]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [44]:
Students_Performance.head(7)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [51]:
Students_Performance.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [54]:
students_performance_dataframe.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [ ]:
students_performance_dataframe.